wingMotion2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
12556
(
31.8693
31.8706
31.8719
31.8739
31.9377
31.9387
31.9393
31.9406
...
)
;

boundaryField
{
    topAndBottom
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 32;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 32;
        value           nonuniform List<scalar> 
62
(
27.9984
28.0257
28.0748
28.1514
28.2
28.0275
27.9242
27.8733
...
)
;
    }
    wing
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
378
(
8477.34
25348
25324.1
28985.6
39429.9
33083.3
29032.7
30233.7
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
